export let data =  {
  nodes: [
    // родственники
    { "id": "Томас Генри Хаксли", "group": 0, "val": 7},
    {"id": "Чарльз Дарвин", "group": 0, "val": 7},

    {"id": "Леонард Хаксли", "group": 1, "val": 5},

    {"id": "Олдос Хаксли", "group": 2, "val": 10},
    {"id": "Джулиан Хаксли", "group": 2, "val": 10},
    {"id": "Эндрю Хаксли", "group": 2},

    // профессиолнальные связи ////
    {"id": "Герберт Уэллс", "group": 3, "val": 10},

    // организации/
    {"id": "Фабианское общество", "group": 0, "val": 20},
    {"id": "ЮНЕСКО", "group": 4, "val": 10},
    {"id": "Фонд дикой природы", "group": 4, "val": 7},
    {"id": "Британское евгеническое общество", "group": 4, "val": 5},
    {"id": "Блумсберийское общество", "group": 4, "val": 4 },
    {"id": "Кембриджские апостолы", "group": 4, "val": 7},
    {"id": "Индийская Лига", "group": 4, "val": 5},
    {"id": "Коэфициенты", "group": 4, "val": 5},
    {"id": "Неоязычники", "group": 4, "val": 5},
    {"id": "Феминизм", "group": 4, "val": 5},






    // персоналии Кембриджские апостолы
    {"id": "Бертран Рассел", "group": 2, "val": 2},
    {"id": "Энтони Блант", "group": 2, "val": 2},
    {"id": "Гай Бёрджес", "group": 2, "val": 2},
    {"id": "Джон Кэрнкрос", "group": 2, "val": 2},
    {"id": "Фентон Джон Хорт", "group": 0, "val": 1},
    {"id": "Джордж Эдвард Мур", "group": 1, "val": 1},
    {"id": "Людвиг Витгенштейн", "group": 1, "val": 1},

    // Блумсбери
    {"id": "Кейнс, Джон Мейнард", "group": 2, "val": 5},
    {"id": "Вирджиния Вульф", "group": 2, "val": 5},


    // Индийская лига
    {"id": "Кришна Менон", "group": 2, "val": 8},

    // Фабианское общество
    {"id": "Джавахарлал Неру", "group": 2, "val": 7},
    {"id": "Мухаммед Али Джинна", "group": 2, "val": 7},
    {"id": "Салама Мусса", "group": 2, "val": 3},
    {"id": "Рупперт Брук", "group": 2, "val": 3},


    // {"id": "Jardine Matheson", "group":0, "val": 10},
    // {"id": "", "group": , "val": },
    // {"id": "", "group": , "val": },









  ],
  links: [
    { "source": "Чарльз Дарвин", "target": "Томас Генри Хаксли", "value": 1 },


    // родственные связи
    { "source": "Томас Генри Хаксли", "target": "Леонард Хаксли", "value": 1 },
    { "source": "Леонард Хаксли", "target": "Олдос Хаксли", "value": 15 },
    { "source": "Леонард Хаксли", "target": "Джулиан Хаксли", "value": 10 },
    { "source": "Леонард Хаксли", "target": "Эндрю Хаксли", "value": 10 },

    // профессиональные связи
    { "source": "Джулиан Хаксли", "target": "Герберт Уэллс", "value": 1 },

    // организации
    { "source": "Джулиан Хаксли", "target": "ЮНЕСКО", "value": 1 },
    { "source": "Джулиан Хаксли", "target": "Фонд дикой природы", "value": 1 },
    { "source": "Джулиан Хаксли", "target": "Британское евгеническое общество", "value": 1 },

    { "source": "Блумсберийское общество", "target": "Олдос Хаксли", "value": 1 },
    { "source": "Блумсберийское общество", "target": "Кейнс, Джон Мейнард", "value": 1 },
    { "source": "Блумсберийское общество", "target": "Вирджиния Вульф", "value": 1 },

    // { "source": "Блумсберийское общество", "target": "Рупперт Брук", "value": 1 },


    { "source": "Кембриджские апостолы", "target": "Энтони Блант", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Гай Бёрджес", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Джон Кэрнкрос", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Бертран Рассел", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Джордж Эдвард Мур", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Людвиг Витгенштейн", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Фентон Джон Хорт", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Кейнс, Джон Мейнард", "value": 1 },
    { "source": "Кембриджские апостолы", "target": "Рупперт Брук", "value": 1 },


    { "source": "Индийская Лига", "target": "Кришна Менон", "value": 1 },
    { "source": "Индийская Лига", "target": "Бертран Рассел", "value": 1 },

    {"source": "Коэфициенты", "target": "Бертран Рассел", "value": 1 },
    {"source": "Коэфициенты", "target": "Герберт Уэллс", "value": 1 },

    { "source": "Фабианское общество", "target": "Герберт Уэллс" },
    { "source": "Фабианское общество", "target": "Джавахарлал Неру" },
    { "source": "Фабианское общество", "target": "Мухаммед Али Джинна" },
    { "source": "Фабианское общество", "target": "Салама Мусса" },
    { "source": "Фабианское общество", "target": "Рупперт Брук" },

    { "source": "Неоязычники", "target": "Рупперт Брук"},

    { "source": "Феминизм", "target": "Вирджиния Вульф"}


    
    // { "source": "Кембриджские апостолы", "target": "Х", "value": 1 },
    // { "source": "Кембриджские апостолы", "target": "Х", "value": 1 },



  ]
}

// export default data
// {"id": "", "group": , "val": }

// { "source": "", "target": ""}
